Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz3_wbz35/apps/zigbee/csc_sleep_touch/firmware/src/packs/WBZ351_DFP/instance/sercom2.h
/*
 * Instance header file for WBZ351
 *
 * Copyright (c) 2022 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2022-06-23T14:51:53Z */
#ifndef _WBZ35_SERCOM2_INSTANCE_
#define _WBZ35_SERCOM2_INSTANCE_


/* ========== Instance Parameter definitions for SERCOM2 peripheral ========== */
#define SERCOM2_SPI                              (0)        
#define SERCOM2_USART                            (0)        
#define SERCOM2_INSTANCE_ID                      (67)       
#define SERCOM2_CHIP_SERCOM_PADDR_MSB            (31)       
#define SERCOM2_CHIP_SERCOM_CLK_REDUCTION        (1)        
#define SERCOM2_CHIP_SERCOM_DMA                  (1)        
#define SERCOM2_CHIP_SERCOM_FIFO_DEPTH_POWER     (1)        
#define SERCOM2_CHIP_SERCOM_RETENTION_SUPPORT    (0)        
#define SERCOM2_CHIP_SERCOM_SPI                  (0)        
#define SERCOM2_CHIP_SERCOM_SPI_HW_SS_CTRL       (0)        
#define SERCOM2_CHIP_SERCOM_SPI_ICSPACE_EXT      (0)        
#define SERCOM2_CHIP_SERCOM_SPI_OZMO             (0)        
#define SERCOM2_CHIP_SERCOM_SPI_WAKE_ON_SSL      (0)        
#define SERCOM2_CHIP_SERCOM_TTBIT_EXTENSION      (1)        
#define SERCOM2_CHIP_SERCOM_TWIM                 (1)        
#define SERCOM2_CHIP_SERCOM_TWIS                 (1)        
#define SERCOM2_CHIP_SERCOM_TWIS_AUTO_ACK        (1)        
#define SERCOM2_CHIP_SERCOM_TWIS_GROUP_CMD       (1)        
#define SERCOM2_CHIP_SERCOM_TWIS_SDASETUP_CNT_SIZE (8)        
#define SERCOM2_CHIP_SERCOM_TWIS_SDASETUP_SIZE   (4)        
#define SERCOM2_CHIP_SERCOM_TWIS_SUDAT           (1)        
#define SERCOM2_CHIP_SERCOM_TWI_FASTMP           (1)        
#define SERCOM2_CHIP_SERCOM_TWI_HSMODE           (1)        
#define SERCOM2_CHIP_SERCOM_TWI_SCLSM_MODE       (1)        
#define SERCOM2_CHIP_SERCOM_TWI_SMB_TIMEOUTS     (1)        
#define SERCOM2_CHIP_SERCOM_TWI_TENBIT_ADR       (1)        
#define SERCOM2_CHIP_SERCOM_USART                (0)        
#define SERCOM2_CHIP_SERCOM_USART_AUTOBAUD       (0)        
#define SERCOM2_CHIP_SERCOM_USART_COLDET         (0)        
#define SERCOM2_CHIP_SERCOM_USART_FLOW_CTRL      (0)        
#define SERCOM2_CHIP_SERCOM_USART_FRAC_BAUD      (0)        
#define SERCOM2_CHIP_SERCOM_USART_IRDA           (0)        
#define SERCOM2_CHIP_SERCOM_USART_ISO7816        (0)        
#define SERCOM2_CHIP_SERCOM_USART_LIN_MASTER     (0)        
#define SERCOM2_CHIP_SERCOM_USART_RS485          (0)        
#define SERCOM2_CHIP_SERCOM_USART_SAMPA_EXT      (0)        
#define SERCOM2_CHIP_SERCOM_USART_SAMPR_EXT      (0)        
#define SERCOM2_CHIP_SERCOM_DLY_COMPENSATION     (1)        
#define SERCOM2_CHIP_SERCOM_SE_CNT               (1)        
#define SERCOM2_DMAC_ID_RX                       (8)        
#define SERCOM2_DMAC_ID_TX                       (9)        
#define SERCOM2_GCLK_ID_SLOW                     (4)        
#define SERCOM2_GCLK_ID_CORE                     (4)        

#endif /* _WBZ35_SERCOM2_INSTANCE_ */
